/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

/*************  功能说明    **************

使用Keil C251编译器，Memory Model推荐设置XSmall模式，默认定义变量在edata，单时钟存取访问速度快。

edata建议保留1K给堆栈使用，空间不够时可将大数组、不常用变量加xdata关键字定义到xdata空间。

串口(115200,N,8,1)打印

下载时, 默认时钟 40MHz (用户可自行修改频率).

******************************************/

#include "STC32G.h"
#include "intrins.h"
#include "stdio.h"
#include "STC32G_NVIC.h"
#include "Type_def.h"
#include "STC32G_Delay.h"
#include "UART_utils.h"
#include "Timer_utils.h"
#include "dhry.h"

extern dhry_main();

void main(void)
{
	TimerInit();
  WTST = 0;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
  EAXFR = 1; //扩展寄存器(XFR)访问使能
  CKCON = 0; //提高访问XRAM速度
	EA = 1;	// Enable Global Interrupt
	
    P0M1 = 0x00;   P0M0 = 0x00;   //设置为准双向口
    P1M1 = 0x00;   P1M0 = 0x00;   //设置为准双向口
    P2M1 = 0x00;   P2M0 = 0x00;   //设置为准双向口
    P3M1 = 0x00;   P3M0 = 0x00;   //设置为准双向口
    P4M1 = 0x00;   P4M0 = 0x00;   //设置为准双向口
    P5M1 = 0x00;   P5M0 = 0x00;   //设置为准双向口
    P6M1 = 0x00;   P6M0 = 0x00;   //设置为准双向口
    P7M1 = 0x00;   P7M0 = 0x00;   //设置为准双向口
	
	
	UartInit();
	printf("AI8051U Dhrystone Benchmark\r\n");
	P10 = 1;
	printf("===Begin Benchmark===\r\n");
	dhry_main();
	printf("===End of Benchmark===\r\n");
	P10 = 0;

	while(1)
    {
			P10 = 1;
      delay_ms(500);
			P10 = 0;
			delay_ms(500);
    }
}